app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Rails is some great shit"], ["updated_at", "2019-05-26 21:51:07.329557"], ["id", 2]]
---
    def update
        find_article

        if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
    def destroy
        find_article

        @article.destroy