app/controllers/comments_controller.rb

    def create
        find_article
        @comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Jeez"], ["body", "This is fort-knox !"], ["article_id", 2], ["created_at", "2019-05-27 01:44:22.228968"], ["updated_at", "2019-05-27 01:44:22.228968"]]

    def destroy
        find_article
        @comment = @article.comments.find(params[:id])
        @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 2], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]

    def find_article
        @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]